Tekla Open API Reference for Tekla Structures 2025
BasePoint.ConvertFromBasePoint Method (BasePoint, Point)
 Converts the given base point point to local point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point ConvertFromBasePoint(
	BasePoint basePoint,
	Point point
)
Public Shared Function ConvertFromBasePoint (
	basePoint As BasePoint,
	point As Point
) As Point
Parameters
basePoint
Type: Tekla.Structures.Model.BasePoint
The base point, from which the point is converted from.
point
Type: Tekla.Structures.Geometry3d.Point
The point to be converted.
Return Value
Type: Point
On success, the converted value. Otherwise the original value.
See Also
Reference
BasePoint Class
ConvertFromBasePoint Overload
Tekla.Structures.Model Namespace